ademeyer/zephyr-project/modules/stm32f746_disco_sai/stm32_ll_sai.h
/**
 ******************************************************************************
 * @file    stm32_sai.h
 * @author  adebayotimileyin@gmail.com
 * @brief   Header file of SAI Zephyr module.
 ******************************************************************************
 * @attention
 *
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32_SAI__H_
#define __STM32_SAI__H_

#ifdef __cplusplus
extern "C"
{
#endif

#define DEBUG_ASSERT 1

/* Includes ------------------------------------------------------------------*/
#include <assert.h>
#include "stm32f746xx.h"

  /** @defgroup SAI_Init_Structure_definition SAI Init Structure definition
   * @brief  SAI Init Structure definition
   * @{
   */
  typedef struct
  {
    uint32_t clock_div;       /* Clock applied to SAI peripherals */
    uint32_t audio_mode;      /* Specifies the SAI Block audio Mode. */
    uint32_t b_sync;          /* Specifies SAI Block synchronization.*/
    uint32_t synchro_ext;     /* Specifies SAI external output synchronization, this setup is common
               for BlockA and BlockB */
    uint32_t output_drv;      /* Specifies when SAI Block outputs are driven.*/
    uint32_t no_divider;      /* Specifies whether master clock will be divided or not, from 8 to
               256*/
    uint32_t fifo_threshold;  /* Specifies SAI Block FIFO threshold. */
    uint32_t a_freq;          /* Specifies the audio frequency sampling. */
    uint32_t mclk_div;        /* Specifies the master clock divider, between Min_Data = 0 and Max_Data
                  = 15.*/
    uint32_t stereo_mode;     /* Specifies if the mono or stereo mode is selected. */
    uint32_t companding_mode; /* Specifies the companding mode type.*/
    uint32_t tri_state;       /* Specifies the companding mode type.*/
    /* This part of the structure is automatically filled if your are using the high level
    initialisation function LL_sai_init_protocol */
    uint32_t protocol;     /* Specifies the SAI Block protocol.*/
    uint32_t data_size;    /* Specifies the SAI Block data size.*/
    uint32_t first_bit;    /* Specifies whether data transfers start from MSB or LSB bit.*/
    uint32_t clk_strobing; /* Specifies the SAI Block clock strobing edge sensitivity.*/
  } sai_init_cfg_t;

  /** @defgroup SAI_Frame_Structure_definition SAI Frame Structure definition
   * @brief  SAI Frame Init structure definition
   * @note   For SPDIF and AC97 protocol, these parameters are not used (set by hardware).
   * @{
   */
  typedef struct
  {
    uint32_t frame_length;        /* Specifies the Frame length, the number of SCK clocks for each
                      audio frame. Min_Data = 8 and Max_Data = 256. */
    uint32_t active_frame_length; /* Specifies the Frame synchronization active level
                 length.vThis Parameter specifies the length in number of
                 bit clock (SCK + 1) of the active level of FS signal in
                 audio frame. This parameter must be a number between
                 Min_Data = 1 and Max_Data = 128 */
    uint32_t fs_definition;       /* Specifies the Frame synchronization definition. */
    uint32_t fs_polarity;         /* Specifies the Frame synchronization Polarity. */
    uint32_t fs_offset;           /* Specifies the Frame synchronization Offset.*/

  } sai_frame_cfg_t;

  /** @defgroup SAI_Slot_Structure_definition SAI Slot Structure definition
   * @brief   SAI Block Slot Init Structure definition
   * @note    For SPDIF protocol, these parameters are not used (set by hardware).
   * @note    For AC97 protocol, only SlotActive parameter is used (the others are set by hardware).
   * @{
   */
  typedef struct
  {
    uint32_t first_bit_offset; /* Specifies the position of first data transfer bit in the slot.
             This parameter must be a number between Min_Data = 0 and
             Max_Data = 24 */
    uint32_t slot_size;        /* Specifies the Slot Size. */
    uint32_t n_slot;           /* Specifies the number of slot in the audio frame. This parameter must be
                   a number between Min_Data = 1 and Max_Data = 16 */
    uint32_t slot_active;      /* Specifies the slots in audio frame that will be activated. */
  } sai_slot_cfg_t;

  /** @defgroup SAI_Handle_Structure_definition SAI Handle Structure definition
   * @brief  SAI handle Structure definition
   * @{
   */
  typedef struct
  {
    SAI_Block_TypeDef *Instance; /* SAI Blockx registers base address */
    sai_init_cfg_t init;         /* SAI communication parameters */
    sai_frame_cfg_t frame_init;  /* SAI Frame configuration parameters */
    sai_slot_cfg_t slot_init;    /* SAI Slot configuration parameters */
    uint32_t sys_clk;            /* system clock used to check in disable sai function */
  } sai_cfg_t;

/* Exported constants --------------------------------------------------------*/

/** @defgroup SAI_Exported_Constants SAI Exported Constants
 * @{
 */
/************* Kernel DELAY **********/
#define WAIT_DELAY 5000UL
/** @defgroup SAI Register bit functions
 * @{
 */
/** @defgroup SAI_Error_Code SAI Error Code
 * @{
 */
#define SAI_ERROR_NONE \
  ((uint32_t)0x00000000U) /* No error                 				*/
#define SAI_ERROR_OVR \
  ((uint32_t)0x00000001U) /* Overrun Error                               		*/
#define SAI_ERROR_UDR \
  ((uint32_t)0x00000002U) /* Underrun error                              		*/
#define SAI_ERROR_AFSDET \
  ((uint32_t)0x00000004U) /* Anticipated Frame synchronisation detection  	*/
#define SAI_ERROR_LFSDET \
  ((uint32_t)0x00000008U)                         /* Late Frame synchronisation detection 		*/
#define SAI_ERROR_CNREADY ((uint32_t)0x00000010U) /* codec not ready */
#define SAI_ERROR_WCKCFG \
  ((uint32_t)0x00000020U) /* Wrong clock configuration 				*/
#define SAI_ERROR_TIMEOUT \
  ((uint32_t)0x00000040U) /* Timeout error                               		*/
#define SAI_ERROR_DMA \
  ((uint32_t)0x00000080U) /* DMA error                                   		*/

/**
 * @}
 */
/** @defgroup SAI_Block
 * @{
 */
#define SAIx_BLOCK_A ((uint32_t)0x00000000U)
#define SAIx_BLOCK_B ((uint32_t)0x00000001U)

/** @defgroup SAI_Block_SyncExt SAI External synchronisation
 * @{
 */
#define SAI_SYNCEXT_DISABLE 0
#define SAI_SYNCEXT_OUTBLOCKA_ENABLE 1
#define SAI_SYNCEXT_OUTBLOCKB_ENABLE 2
/**
 * @}
 */

/** @defgroup SAI_Protocol SAI Supported protocol
 * @{
 */
#define SAI_I2S_STANDARD 0
#define SAI_I2S_MSBJUSTIFIED 1
#define SAI_I2S_LSBJUSTIFIED 2
#define SAI_PCM_LONG 3
#define SAI_PCM_SHORT 4
/**
 * @}
 */

/** @defgroup SAI_Protocol_DataSize SAI protocol data size
 * @{
 */
#define SAI_PROTOCOL_DATASIZE_16BIT 0
#define SAI_PROTOCOL_DATASIZE_16BITEXTENDED 1
#define SAI_PROTOCOL_DATASIZE_24BIT 2
#define SAI_PROTOCOL_DATASIZE_32BIT 3
/**
 * @}
 */

/** @defgroup SAI_Audio_Frequency SAI Audio Frequency
 * @{
 */
#define SAI_AUDIO_FREQUENCY_192K ((uint32_t)192000U)
#define SAI_AUDIO_FREQUENCY_96K ((uint32_t)96000U)
#define SAI_AUDIO_FREQUENCY_48K ((uint32_t)48000U)
#define SAI_AUDIO_FREQUENCY_44K ((uint32_t)44100U)
#define SAI_AUDIO_FREQUENCY_32K ((uint32_t)32000U)
#define SAI_AUDIO_FREQUENCY_22K ((uint32_t)22050U)
#define SAI_AUDIO_FREQUENCY_16K ((uint32_t)16000U)
#define SAI_AUDIO_FREQUENCY_11K ((uint32_t)11025U)
#define SAI_AUDIO_FREQUENCY_8K ((uint32_t)8000U)
#define SAI_AUDIO_FREQUENCY_MCKDIV ((uint32_t)0U)
/**
 * @}
 */

/** @defgroup SAI_Block_Mode SAI Block Mode
 * @{
 */
#define SAI_MODEMASTER_TX ((uint32_t)0x00000000U)
#define SAI_MODEMASTER_RX ((uint32_t)SAI_xCR1_MODE_0)
#define SAI_MODESLAVE_TX ((uint32_t)SAI_xCR1_MODE_1)
#define SAI_MODESLAVE_RX ((uint32_t)(SAI_xCR1_MODE_1 | SAI_xCR1_MODE_0))

/**
 * @}
 */

/** @defgroup SAI_Block_Protocol SAI Block Protocol
 * @{
 */
#define SAI_FREE_PROTOCOL ((uint32_t)0x00000000U)
#define SAI_SPDIF_PROTOCOL ((uint32_t)SAI_xCR1_PRTCFG_0)
#define SAI_AC97_PROTOCOL ((uint32_t)SAI_xCR1_PRTCFG_1)
/**
 * @}
 */

/** @defgroup SAI_Block_Data_Size SAI Block Data Size
 * @{
 */
#define SAI_DATASIZE_8 ((uint32_t)SAI_xCR1_DS_1)
#define SAI_DATASIZE_10 ((uint32_t)(SAI_xCR1_DS_1 | SAI_xCR1_DS_0))
#define SAI_DATASIZE_16 ((uint32_t)SAI_xCR1_DS_2)
#define SAI_DATASIZE_20 ((uint32_t)(SAI_xCR1_DS_2 | SAI_xCR1_DS_0))
#define SAI_DATASIZE_24 ((uint32_t)(SAI_xCR1_DS_2 | SAI_xCR1_DS_1))
#define SAI_DATASIZE_32 ((uint32_t)(SAI_xCR1_DS_2 | SAI_xCR1_DS_1 | SAI_xCR1_DS_0))
/**
 * @}
 */

/** @defgroup SAI_Block_MSB_LSB_transmission SAI Block MSB LSB transmission
 * @{
 */
#define SAI_FIRSTBIT_MSB ((uint32_t)0x00000000U)
#define SAI_FIRSTBIT_LSB ((uint32_t)SAI_xCR1_LSBFIRST)
/**
 * @}
 */

