ademeyer/zephyr-project/modules/stm32f746_disco_sai/stm32_ll_sai.h
/** @defgroup SAI_Block_Clock_Strobing SAI Block Clock Strobing
 * @{
 */
#define SAI_CLOCKSTROBING_FALLINGEDGE 0
#define SAI_CLOCKSTROBING_RISINGEDGE 1
/**
 * @}
 */

/** @defgroup SAI_Block_Synchronization SAI Block Synchronization
 * @{
 */
#define SAI_ASYNCHRONOUS 0         /* Asynchronous */
#define SAI_SYNCHRONOUS 1          /* Synchronous with other block of same SAI */
#define SAI_SYNCHRONOUS_EXT_SAI1 2 /* Synchronous with other SAI, SAI1 */
#define SAI_SYNCHRONOUS_EXT_SAI2 3 /* Synchronous with other SAI, SAI2 */
/**
 * @}
 */

/** @defgroup SAI_Block_Output_Drive SAI Block Output Drive
 * @{
 */
#define SAI_OUTPUTDRIVE_DISABLE ((uint32_t)0x00000000U)
#define SAI_OUTPUTDRIVE_ENABLE ((uint32_t)SAI_xCR1_OUTDRIV)
/**
 * @}
 */

/** @defgroup SAI_Block_NoDivider SAI Block NoDivider
 * @{
 */
#define SAI_MASTERDIVIDER_ENABLE ((uint32_t)0x00000000U)
#define SAI_MASTERDIVIDER_DISABLE ((uint32_t)SAI_xCR1_NODIV)
/**
 * @}
 */

/** @defgroup SAI_Block_FS_Definition SAI Block FS Definition
 * @{
 */
#define SAI_FS_STARTFRAME ((uint32_t)0x00000000U)
#define SAI_FS_CHANNEL_IDENTIFICATION ((uint32_t)SAI_xFRCR_FSDEF)
/**
 * @}
 */

/** @defgroup SAI_Block_FS_Polarity SAI Block FS Polarity
 * @{
 */
#define SAI_FS_ACTIVE_LOW ((uint32_t)0x00000000U)
#define SAI_FS_ACTIVE_HIGH ((uint32_t)SAI_xFRCR_FSPOL)
/**
 * @}
 */

/** @defgroup SAI_Block_FS_Offset SAI Block FS Offset
 * @{
 */
#define SAI_FS_FIRSTBIT ((uint32_t)0x00000000U)
#define SAI_FS_BEFOREFIRSTBIT ((uint32_t)SAI_xFRCR_FSOFF)
/**
 * @}
 */

/** @defgroup SAI_Block_Slot_Size SAI Block Slot Size
 * @{
 */
#define SAI_SLOTSIZE_DATASIZE ((uint32_t)0x00000000U)
#define SAI_SLOTSIZE_16B ((uint32_t)SAI_xSLOTR_SLOTSZ_0)
#define SAI_SLOTSIZE_32B ((uint32_t)SAI_xSLOTR_SLOTSZ_1)
/**
 * @}
 */

/** @defgroup SAI_Block_Slot_Active SAI Block Slot Active
 * @{
 */
#define SAI_SLOT_NOTACTIVE ((uint32_t)0x00000000U)
#define SAI_SLOTACTIVE_0 ((uint32_t)0x00000001U)
#define SAI_SLOTACTIVE_1 ((uint32_t)0x00000002U)
#define SAI_SLOTACTIVE_2 ((uint32_t)0x00000004U)
#define SAI_SLOTACTIVE_3 ((uint32_t)0x00000008U)
#define SAI_SLOTACTIVE_4 ((uint32_t)0x00000010U)
#define SAI_SLOTACTIVE_5 ((uint32_t)0x00000020U)
#define SAI_SLOTACTIVE_6 ((uint32_t)0x00000040U)
#define SAI_SLOTACTIVE_7 ((uint32_t)0x00000080U)
#define SAI_SLOTACTIVE_8 ((uint32_t)0x00000100U)
#define SAI_SLOTACTIVE_9 ((uint32_t)0x00000200U)
#define SAI_SLOTACTIVE_10 ((uint32_t)0x00000400U)
#define SAI_SLOTACTIVE_11 ((uint32_t)0x00000800U)
#define SAI_SLOTACTIVE_12 ((uint32_t)0x00001000U)
#define SAI_SLOTACTIVE_13 ((uint32_t)0x00002000U)
#define SAI_SLOTACTIVE_14 ((uint32_t)0x00004000U)
#define SAI_SLOTACTIVE_15 ((uint32_t)0x00008000U)
#define SAI_SLOTACTIVE_ALL ((uint32_t)0x0000FFFFU)
/**
 * @}
 */

/** @defgroup SAI_Mono_Stereo_Mode SAI Mono Stereo Mode
 * @{
 */
#define SAI_STEREOMODE ((uint32_t)0x00000000U)
#define SAI_MONOMODE ((uint32_t)SAI_xCR1_MONO)
/**
 * @}
 */

/** @defgroup SAI_TRIState_Management SAI TRIState Management
 * @{
 */
#define SAI_OUTPUT_NOTRELEASED ((uint32_t)0x00000000U)
#define SAI_OUTPUT_RELEASED ((uint32_t)SAI_xCR2_TRIS)
/**
 * @}
 */

/** @defgroup SAI_Block_Fifo_Threshold SAI Block Fifo Threshold
 * @{
 */
#define SAI_FIFOTHRESHOLD_EMPTY ((uint32_t)0x00000000U)
#define SAI_FIFOTHRESHOLD_1QF ((uint32_t)(SAI_xCR2_FTH_0))
#define SAI_FIFOTHRESHOLD_HF ((uint32_t)(SAI_xCR2_FTH_1))
#define SAI_FIFOTHRESHOLD_3QF ((uint32_t)(SAI_xCR2_FTH_1 | SAI_xCR2_FTH_0))
#define SAI_FIFOTHRESHOLD_FULL ((uint32_t)(SAI_xCR2_FTH_2))
/**
 * @}
 */

/** @defgroup SAI_Block_Companding_Mode SAI Block Companding Mode
 * @{
 */
#define SAI_NOCOMPANDING ((uint32_t)0x00000000U)
#define SAI_ULAW_1CPL_COMPANDING ((uint32_t)(SAI_xCR2_COMP_1))
#define SAI_ALAW_1CPL_COMPANDING ((uint32_t)(SAI_xCR2_COMP_1 | SAI_xCR2_COMP_0))
#define SAI_ULAW_2CPL_COMPANDING ((uint32_t)(SAI_xCR2_COMP_1 | SAI_xCR2_CPL))
#define SAI_ALAW_2CPL_COMPANDING ((uint32_t)(SAI_xCR2_COMP_1 | SAI_xCR2_COMP_0 | SAI_xCR2_CPL))
/**
 * @}
 */

/** @defgroup SAI_Block_Mute_Value SAI Block Mute Value
 * @{
 */
#define SAI_ZERO_VALUE ((uint32_t)0x00000000U)
#define SAI_LAST_SENT_VALUE ((uint32_t)SAI_xCR2_MUTEVAL)
/**
 * @}
 */

/** @defgroup SAI_Block_Interrupts_Definition SAI Block Interrupts Definition
 * @{
 */
#define SAI_IT_OVRUDR ((uint32_t)SAI_xIMR_OVRUDRIE)
#define SAI_IT_MUTEDET ((uint32_t)SAI_xIMR_MUTEDETIE)
#define SAI_IT_WCKCFG ((uint32_t)SAI_xIMR_WCKCFGIE)
#define SAI_IT_FREQ ((uint32_t)SAI_xIMR_FREQIE)
#define SAI_IT_CNRDY ((uint32_t)SAI_xIMR_CNRDYIE)
#define SAI_IT_AFSDET ((uint32_t)SAI_xIMR_AFSDETIE)
#define SAI_IT_LFSDET ((uint32_t)SAI_xIMR_LFSDETIE)
/**
 * @}
 */

/** @defgroup SAI_Block_Flags_Definition  SAI Block Flags Definition
 * @{
 */
#define SAI_FLAG_OVRUDR ((uint32_t)SAI_xSR_OVRUDR)
#define SAI_FLAG_MUTEDET ((uint32_t)SAI_xSR_MUTEDET)
#define SAI_FLAG_WCKCFG ((uint32_t)SAI_xSR_WCKCFG)
#define SAI_FLAG_FREQ ((uint32_t)SAI_xSR_FREQ)
#define SAI_FLAG_CNRDY ((uint32_t)SAI_xSR_CNRDY)
#define SAI_FLAG_AFSDET ((uint32_t)SAI_xSR_AFSDET)
#define SAI_FLAG_LFSDET ((uint32_t)SAI_xSR_LFSDET)
/**
 * @}
 */

/** @defgroup SAI_Block_Fifo_Status_Level   SAI Block Fifo Status Level
 * @{
 */
#define SAI_FIFOSTATUS_EMPTY ((uint32_t)0x00000000U)
#define SAI_FIFOSTATUS_LESS1QUARTERFULL ((uint32_t)0x00010000U)
#define SAI_FIFOSTATUS_1QUARTERFULL ((uint32_t)0x00020000U)
#define SAI_FIFOSTATUS_HALFFULL ((uint32_t)0x00030000U)
#define SAI_FIFOSTATUS_3QUARTERFULL ((uint32_t)0x00040000U)
#define SAI_FIFOSTATUS_FULL ((uint32_t)0x00050000U)
/**
 * @}
 */

/**
 * @}
 */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup SAI_Exported_Macros SAI Exported Macros
 * @brief macros to handle interrupts and specific configurations
 * @{
 */

/** @brief Reset SAI handle state.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @retval None
 */
#define SET 1
#define RESET 0

#define __SAI_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->state = SAI_STATE_RESET)

/** @brief  Enable or disable the specified SAI interrupts.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __INTERRUPT__ specifies the interrupt source to enable or disable.
 *         This parameter can be one of the following values:
 *            @arg SAI_IT_OVRUDR: Overrun underrun interrupt enable
 *            @arg SAI_IT_MUTEDET: Mute detection interrupt enable
 *            @arg SAI_IT_WCKCFG: Wrong Clock Configuration interrupt enable
 *            @arg SAI_IT_FREQ: FIFO request interrupt enable
 *            @arg SAI_IT_CNRDY: Codec not ready interrupt enable
 *            @arg SAI_IT_AFSDET: Anticipated frame synchronization detection interrupt enable
 *            @arg SAI_IT_LFSDET: Late frame synchronization detection interrupt enable
 * @retval None
 */
#define __SAI_ENABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->IMR |= (__INTERRUPT__))
#define __SAI_DISABLE_IT(__HANDLE__, __INTERRUPT__) ((__HANDLE__)->IMR &= (~(__INTERRUPT__)))

/** @brief  Check whether the specified SAI interrupt source is enabled or not.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __INTERRUPT__ specifies the SAI interrupt source to check.
 *         This parameter can be one of the following values:
 *            @arg SAI_IT_OVRUDR: Overrun underrun interrupt enable
 *            @arg SAI_IT_MUTEDET: Mute detection interrupt enable
 *            @arg SAI_IT_WCKCFG: Wrong Clock Configuration interrupt enable
 *            @arg SAI_IT_FREQ: FIFO request interrupt enable
 *            @arg SAI_IT_CNRDY: Codec not ready interrupt enable
 *            @arg SAI_IT_AFSDET: Anticipated frame synchronization detection interrupt enable
 *            @arg SAI_IT_LFSDET: Late frame synchronization detection interrupt enable
 * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
 */
#define __SAI_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__) \
  ((((__HANDLE__)->IMR & (__INTERRUPT__)) == (__INTERRUPT__)) ? SET : RESET)

/** @brief  Check whether the specified SAI flag is set or not.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __FLAG__ specifies the flag to check.
 *         This parameter can be one of the following values:
 *            @arg SAI_FLAG_OVRUDR: Overrun underrun flag.
 *            @arg SAI_FLAG_MUTEDET: Mute detection flag.
 *            @arg SAI_FLAG_WCKCFG: Wrong Clock Configuration flag.
 *            @arg SAI_FLAG_FREQ: FIFO request flag.
 *            @arg SAI_FLAG_CNRDY: Codec not ready flag.
 *            @arg SAI_FLAG_AFSDET: Anticipated frame synchronization detection flag.
 *            @arg SAI_FLAG_LFSDET: Late frame synchronization detection flag.
 * @retval The new state of __FLAG__ (TRUE or FALSE).
 */
#define __SAI_GET_FLAG(__HANDLE__, __FLAG__) ((((__HANDLE__)->SR) & (__FLAG__)) == (__FLAG__))

/** @brief  Clear the specified SAI pending flag.
 * @param  __HANDLE__ specifies the SAI Handle.
 * @param  __FLAG__ specifies the flag to check.
 *          This parameter can be any combination of the following values:
 *            @arg SAI_FLAG_OVRUDR: Clear Overrun underrun
 *            @arg SAI_FLAG_MUTEDET: Clear Mute detection
 *            @arg SAI_FLAG_WCKCFG: Clear Wrong Clock Configuration
 *            @arg SAI_FLAG_FREQ: Clear FIFO request
 *            @arg SAI_FLAG_CNRDY: Clear Codec not ready
 *            @arg SAI_FLAG_AFSDET: Clear Anticipated frame synchronization detection
 *            @arg SAI_FLAG_LFSDET: Clear Late frame synchronization detection
 *
 * @retval None
 */
#define __SAI_CLEAR_FLAG(__HANDLE__, __FLAG__) ((__HANDLE__)->CLRFR = (__FLAG__))

#define __SAI_ENABLE(__HANDLE__) ((__HANDLE__)->CR1 |= SAI_xCR1_SAIEN)
#define __SAI_DISABLE(__HANDLE__) ((__HANDLE__)->CR1 &= ~SAI_xCR1_SAIEN)

  /**
   * @}
   */

  /* Exported functions --------------------------------------------------------*/
  /** @addtogroup SAI_Exported_Functions
   * @{
   */

  /* Initialization/de-initialization functions  ********************************/
  /** @addtogroup SAI_Exported_Functions_Group1
   * @{
   */
  int LL_sai_init_ll_subsystem(SAI_TypeDef *sai, uint32_t protocol, uint32_t datasize,
                               uint32_t audiomode, uint32_t audiofrequency, uint32_t nbslot,
                               uint32_t clk_strobs, uint32_t pclk_div);
  int LL_sai_deinit_ll_subsystem(SAI_TypeDef *sai);

  /**
   * @}
   */

