ademeyer/zephyr-project/modules/stm32f746_disco_sai/stm32_ll_sai.h
  /* I/O operation functions  ***************************************************/
  /** @addtogroup SAI_Exported_Functions_Group2
   * @{
   */

  /* Operational Functions */
  void LL_sai_set_transfer_mode_ll_subsystem(SAI_TypeDef *sai_x, uint32_t mode);
  void LL_sai_enable_tx_mute_mode_ll_subsystem(SAI_TypeDef *sai, uint16_t val);
  void LL_sai_disable_tx_mute_mode_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_FIFO_empty_ll_subsystem(SAI_TypeDef *sai_x);

  /* SAI IO Register Functions */
  __IO uint32_t *LL_sai_get_register_ll_subsystem(SAI_TypeDef *sai);

  /* DMA Related Functions */
  void LL_sai_dma_resume_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_dma_abort_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_get_dma_status_ll_subsystem(SAI_TypeDef *sai);

  /* Peripheral enable / disable */
  int LL_sai_disable_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_enable_ll_subsystem(SAI_TypeDef *sai);

  /* Disable ISR Event */
  void LL_sai_disable_OVRUDR_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_disable_MUTEDET_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_disable_WCKCFG_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_disable_FREQ_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_disable_CNRDY_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_disable_AFSDET_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_disable_LFSDET_ll_subsystem(SAI_TypeDef *sai);

  /* Enable ISR Event */
  void LL_sai_enable_OVRUDR_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_emable_MUTEDET_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_enable_WCKCFG_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_enable_FREQ_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_enable_CNRDY_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_enable_AFSDET_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_enable_LFSDET_ll_subsystem(SAI_TypeDef *sai);

  /* Get ISR Event */
  int LL_sai_get_OVRUDR_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_get_MUTEDET_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_get_WCKCFG_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_get_FREQ_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_get_CNRDY_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_get_AFSDET_ll_subsystem(SAI_TypeDef *sai);
  int LL_sai_get_LFSDET_ll_subsystem(SAI_TypeDef *sai);

  /* Clear ISR Event */
  void LL_sai_clear_OVRUDR_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_clear_MUTEDET_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_clear_WCKCFG_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_clear_FREQ_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_clear_CNRDY_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_clear_AFSDET_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_clear_LFSDET_ll_subsystem(SAI_TypeDef *sai);
  void LL_sai_clear_all_ISR_ll_subsystem(SAI_TypeDef *sai);

  /**
   * @}
   */

  /** @addtogroup SAI_Exported_Functions_Group3
   * @{
   */

#define LL_CLEAR_BIT(REG, BIT_MASK) ((REG) &= ~(BIT_MASK)) /* Clear register bit */
#define LL_SET_BIT(REG, BIT) ((REG) |= (BIT))              /* Set register bit */

#define LL_IS_SAI_ALL_INSTANCE(INSTANCE) (INSTANCE == SAI1) || (INSTANCE == SAI2)

#define LL_IS_SAI_BLOCK_SYNCEXT(STATE) \
  (((STATE) == SAI_SYNCEXT_DISABLE) || \
   ((STATE) == SAI_SYNCEXT_OUTBLOCKA_ENABLE) | ((STATE) == SAI_SYNCEXT_OUTBLOCKB_ENABLE))

#define LL_IS_SAI_SUPPORTED_PROTOCOL(PROTOCOL)                                 \
  (((PROTOCOL) == SAI_I2S_STANDARD) || ((PROTOCOL) == SAI_I2S_LSBJUSTIFIED) || \
   ((PROTOCOL) == SAI_I2S_MSBJUSTIFIED) || ((PROTOCOL) == SAI_PCM_SHORT) ||    \
   ((PROTOCOL) == SAI_PCM_LONG))

#define LL_IS_SAI_PROTOCOL_DATASIZE(DATASIZE)             \
  (((DATASIZE) == SAI_PROTOCOL_DATASIZE_16BIT) ||         \
   ((DATASIZE) == SAI_PROTOCOL_DATASIZE_16BITEXTENDED) || \
   ((DATASIZE) == SAI_PROTOCOL_DATASIZE_24BIT) ||         \
   ((DATASIZE) == SAI_PROTOCOL_DATASIZE_32BIT))

#define LL_IS_SAI_AUDIO_FREQUENCY(AUDIO)                                            \
  (((AUDIO) == SAI_AUDIO_FREQUENCY_192K) || ((AUDIO) == SAI_AUDIO_FREQUENCY_96K) || \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_48K) || ((AUDIO) == SAI_AUDIO_FREQUENCY_44K) ||  \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_32K) || ((AUDIO) == SAI_AUDIO_FREQUENCY_22K) ||  \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_16K) || ((AUDIO) == SAI_AUDIO_FREQUENCY_11K) ||  \
   ((AUDIO) == SAI_AUDIO_FREQUENCY_8K) || ((AUDIO) == SAI_AUDIO_FREQUENCY_MCKDIV))

#define LL_IS_SAI_BLOCK_MODE(MODE)                                   \
  (((MODE) == SAI_MODEMASTER_TX) || ((MODE) == SAI_MODEMASTER_RX) || \
   ((MODE) == SAI_MODESLAVE_TX) || ((MODE) == SAI_MODESLAVE_RX))

#define LL_IS_SAI_BLOCK_PROTOCOL(PROTOCOL)                                   \
  (((PROTOCOL) == SAI_FREE_PROTOCOL) || ((PROTOCOL) == SAI_AC97_PROTOCOL) || \
   ((PROTOCOL) == SAI_SPDIF_PROTOCOL))

#define LL_IS_SAI_BLOCK_DATASIZE(DATASIZE)                               \
  (((DATASIZE) == SAI_DATASIZE_8) || ((DATASIZE) == SAI_DATASIZE_10) ||  \
   ((DATASIZE) == SAI_DATASIZE_16) || ((DATASIZE) == SAI_DATASIZE_20) || \
   ((DATASIZE) == SAI_DATASIZE_24) || ((DATASIZE) == SAI_DATASIZE_32))

#define LL_IS_SAI_BLOCK_FIRST_BIT(BIT) (((BIT) == SAI_FIRSTBIT_MSB) || ((BIT) == SAI_FIRSTBIT_LSB))

#define LL_IS_SAI_BLOCK_CLOCK_STROBING(CLOCK) \
  (((CLOCK) == SAI_CLOCKSTROBING_FALLINGEDGE) || ((CLOCK) == SAI_CLOCKSTROBING_RISINGEDGE))

#define LL_IS_SAI_BLOCK_SYNCHRO(SYNCHRO)                                \
  (((SYNCHRO) == SAI_ASYNCHRONOUS) || ((SYNCHRO) == SAI_SYNCHRONOUS) || \
   ((SYNCHRO) == SAI_SYNCHRONOUS_EXT_SAI1) || ((SYNCHRO) == SAI_SYNCHRONOUS_EXT_SAI2))

#define LL_IS_SAI_BLOCK_OUTPUT_DRIVE(DRIVE) \
  (((DRIVE) == SAI_OUTPUTDRIVE_DISABLE) || ((DRIVE) == SAI_OUTPUTDRIVE_ENABLE))

#define LL_IS_SAI_BLOCK_NODIVIDER(NODIVIDER) \
  (((NODIVIDER) == SAI_MASTERDIVIDER_ENABLE) || ((NODIVIDER) == SAI_MASTERDIVIDER_DISABLE))

#define LL_IS_SAI_BLOCK_MUTE_COUNTER(COUNTER) ((COUNTER) <= 63)

#define LL_IS_SAI_BLOCK_MUTE_VALUE(VALUE) \
  (((VALUE) == SAI_ZERO_VALUE) || ((VALUE) == SAI_LAST_SENT_VALUE))

#define LL_IS_SAI_BLOCK_COMPANDING_MODE(MODE)                                      \
  (((MODE) == SAI_NOCOMPANDING) || ((MODE) == SAI_ULAW_1CPL_COMPANDING) ||         \
   ((MODE) == SAI_ALAW_1CPL_COMPANDING) || ((MODE) == SAI_ULAW_2CPL_COMPANDING) || \
   ((MODE) == SAI_ALAW_2CPL_COMPANDING))

#define LL_IS_SAI_BLOCK_FIFO_THRESHOLD(THRESHOLD)                                        \
  (((THRESHOLD) == SAI_FIFOTHRESHOLD_EMPTY) || ((THRESHOLD) == SAI_FIFOTHRESHOLD_1QF) || \
   ((THRESHOLD) == SAI_FIFOTHRESHOLD_HF) || ((THRESHOLD) == SAI_FIFOTHRESHOLD_3QF) ||    \
   ((THRESHOLD) == SAI_FIFOTHRESHOLD_FULL))

#define LL_IS_SAI_BLOCK_TRISTATE_MANAGEMENT(STATE) \
  (((STATE) == SAI_OUTPUT_NOTRELEASED) || ((STATE) == SAI_OUTPUT_RELEASED))

#define LL_IS_SAI_MONO_STEREO_MODE(MODE) (((MODE) == SAI_MONOMODE) || ((MODE) == SAI_STEREOMODE))

#define LL_IS_SAI_SLOT_ACTIVE(ACTIVE) ((ACTIVE) <= SAI_SLOTACTIVE_ALL)

#define LL_IS_SAI_BLOCK_SLOT_NUMBER(NUMBER) ((1 <= (NUMBER)) && ((NUMBER) <= 16))

#define LL_IS_SAI_BLOCK_SLOT_SIZE(SIZE)                                 \
  (((SIZE) == SAI_SLOTSIZE_DATASIZE) || ((SIZE) == SAI_SLOTSIZE_16B) || \
   ((SIZE) == SAI_SLOTSIZE_32B))

#define LL_IS_SAI_BLOCK_FIRSTBIT_OFFSET(OFFSET) ((OFFSET) <= 24)

#define LL_IS_SAI_BLOCK_FS_OFFSET(OFFSET) \
  (((OFFSET) == SAI_FS_FIRSTBIT) | ((OFFSET) == SAI_FS_BEFOREFIRSTBIT))

#define LL_IS_SAI_BLOCK_FS_POLARITY(POLARITY) \
  (((POLARITY) == SAI_FS_ACTIVE_LOW) || ((POLARITY) == SAI_FS_ACTIVE_HIGH))

#define LL_IS_SAI_BLOCK_FS_DEFINITION(DEFINITION) \
  (((DEFINITION) == SAI_FS_STARTFRAME) || ((DEFINITION) == SAI_FS_CHANNEL_IDENTIFICATION))

#define LL_IS_SAI_BLOCK_MASTER_DIVIDER(DIVIDER) ((DIVIDER) <= 15U)

#define LL_IS_SAI_BLOCK_FRAME_LENGTH(LENGTH) ((8 <= (LENGTH)) && ((LENGTH) <= 256))

#define LL_IS_SAI_BLOCK_ACTIVE_FRAME(LENGTH) ((1 <= (LENGTH)) && ((LENGTH) <= 128))

#ifdef __cplusplus
}
#endif
#endif
